app/views/admin/items/edit.html.slim

SELECT "songs".* FROM "songs" WHERE "songs"."disc_id" = ?  [["disc_id", 1]]
---
        span.disc-edit-btn.btn.btn-primary ディスク編集
        - if disc.songs.empty?

SELECT "songs".* FROM "songs" WHERE "songs"."disc_id" = ?  [["disc_id", 1]]
---
        - @item_discs.each do |disc|
          - disc.songs.each do |song|