app/controllers/admin/discs_controller.rb

INSERT INTO "discs" ("item_id", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?)  [["item_id", 2], ["created_at", "2019-07-21 05:34:51.235915"], ["updated_at", "2019-07-21 05:34:51.235915"], ["name", "浅瀬"]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "discs".* FROM "discs" WHERE "discs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def create
        @disc = Disc.new(disc_params)
        if @disc.save
            redirect_to edit_admin_item_path(params[:item_id]), data: {"turbolinks" => false}
        else
            @singers = pull_down_menu(Singer.all)
            @genres = pull_down_menu(Genre.all)
            @labels = pull_down_menu(Label.all)
            @item = Item.find(params[:item_id])
            @item_discs = @item.discs.all

SELECT  "discs".* FROM "discs" WHERE "discs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "discs" SET "name" = ?, "updated_at" = ? WHERE "discs"."id" = ?  [["name", "中層"], ["updated_at", "2019-07-21 08:33:47.043840"], ["id", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def update
        @disc = Disc.find(params[:id])
        if @disc.update(disc_params)
            redirect_to edit_admin_item_path(params[:item_id]), data: {"turbolinks" => false}
        else
            @singers = pull_down_menu(Singer.all)
            @genres = pull_down_menu(Genre.all)
            @labels = pull_down_menu(Label.all)
            @item = Item.find(params[:item_id])