app/controllers/admin/item_kinds_controller.rb

SELECT "singers".* FROM "singers"
SELECT "genres".* FROM "genres"
SELECT "labels".* FROM "labels"
---
    def index
        @singers = Singer.all
        @genres = Genre.all
        @labels = Label.all