app/controllers/admin/items_controller.rb

  def new
    @item = Item.new
    @singers = pull_down_menu(Singer.all)
    @genres = pull_down_menu(Genre.all)
    @labels = pull_down_menu(Label.all)
---
SELECT "singers".* FROM "singers"
SELECT "genres".* FROM "genres"
SELECT "labels".* FROM "labels"

  def edit
    @singers = pull_down_menu(Singer.all)
    @genres = pull_down_menu(Genre.all)
    @labels = pull_down_menu(Label.all)
    @item = Item.find(params[:id])
    @item_discs = @item.discs.all
---
SELECT "singers".* FROM "singers"
SELECT "genres".* FROM "genres"
SELECT "labels".* FROM "labels"
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "discs".* FROM "discs" WHERE "discs"."item_id" = ?  [["item_id", 2]]

  def create
    @item = Item.new(item_params)
    if @item.save
---
INSERT INTO "items" ("image_id", "singer_id", "name", "label_id", "genre_id", "delivery_status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @item = Item.find(params[:id])
    if @item.update(item_params)
      redirect_to edit_admin_item_path(@item)
    else
      @singers = pull_down_menu(Singer.all)
      @genres = pull_down_menu(Genre.all)
      @labels = pull_down_menu(Label.all)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "image_id" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image_id", "0"], ["updated_at", "2019-07-21 07:50:22.377695"], ["id", 1]]
SELECT "singers".* FROM "singers"
SELECT "genres".* FROM "genres"
SELECT "labels".* FROM "labels"

  def destroy
    item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]