app/controllers/admin/labels_controller.rb

    def create
        @label = Label.new(label_params)
        if @label.save
---
INSERT INTO "labels" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "テスト"], ["created_at", "2019-07-20 08:50:16.419650"], ["updated_at", "2019-07-20 08:50:16.419650"]]

    def destroy
        @label = Label.find(params[:id])
        @label.delete
---
SELECT  "labels".* FROM "labels" WHERE "labels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "labels" WHERE "labels"."id" = ?  [["id", 1]]