app/controllers/admin/singers_controller.rb

INSERT INTO "singers" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "サカナクション"], ["created_at", "2019-07-20 08:50:09.824265"], ["updated_at", "2019-07-20 08:50:09.824265"]]
---
    def create
        @singer = Singer.new(singer_params)
        if @singer.save

SELECT  "singers".* FROM "singers" WHERE "singers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "singers" WHERE "singers"."id" = ?  [["id", 1]]
---
    def destroy
        @singer = Singer.find(params[:id])
        @singer.delete