app/controllers/admin/songs_controller.rb

INSERT INTO "songs" ("name", "number", "disc_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "新宝島"], ["number", 1], ["disc_id", 1], ["created_at", "2019-07-21 05:46:37.047989"], ["updated_at", "2019-07-21 05:46:37.047989"]]
SELECT  "discs".* FROM "discs" WHERE "discs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def create
      @song = Song.new(song_params)
      if @song.save
        redirect_to edit_admin_item_path(params[:item_id]), data: {"turbolinks" => false}
      else
        @singers = pull_down_menu(Singer.all)
        @genres = pull_down_menu(Genre.all)
        @labels = pull_down_menu(Label.all)
        @item = Item.find(params[:item_id])
        @item_discs = @item.discs.all

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "songs" SET "name" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["name", "新宝島ex"], ["updated_at", "2019-07-21 08:02:59.441390"], ["id", 1]]
SELECT  "discs".* FROM "discs" WHERE "discs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def update
        @song = Song.find(params[:id])
        if @song.update(song_params)
            redirect_to edit_admin_item_path(params[:item_id]), data: {"turbolinks" => false}
        else
            @singers = pull_down_menu(Singer.all)
            @genres = pull_down_menu(Genre.all)
            @labels = pull_down_menu(Label.all)
            @item = Item.find(params[:item_id])
            @item_discs = @item.discs.all